{"img":["https://mirafit.co.uk/media/catalog/product/cache/79c51d00d9e5a83841cf49a27ce77240/M/i/Mirafit-M20-Flat-Weight-Bench-Orange.jpg"],"name":"Mirafit M2 Flat Weight Bench","price":"£119.95","overview":"Our latest M2 Series Flat Weight Bench features a comfortable anti slip pad and strong 60mm x 60mm steel frame. The M240 bench is simple to assemble and ideal for use in home gyms and personal training studios. Available in black or orange.","description":["Mirafit M2 Flat Weight Bench ","Latest generation M2 series utility gym bench ","Ideal for a range of strength training exercises ","Use with dumbbells to workout chest, back & arm muscles ","Can be used with any Mirafit squat or power rack ","Suitable for use in home gyms, garage gyms and personal training studios ","Powder coated finish in a choice of black or orange colour ","Strong 60mm x 60mm x 3mm (11 gauge) steel frame ","Comfortable 70mm thick pad with anti slip fabric ","Mirafit emblem foot caps  ","Easy to assemble. Instructions included. ","Assembly requires 2 x 17mm spanners (not included) ","Bench net weight: 23kg ","Bench measurements: ","Length: 123cm ","Width: 47.5cm ","Height: 43cm ","Pad measurements: ","Length: 123cm ","Width 30cm ","Height 7cm "],"rating":"4.7","reviews":[{"author":"\nVega ","date":"\nMar 29, 2023 ","title":"\nSolid bit of kit ","rating":"\n100%\n","body":"\nI’m tall and over 100kg, this bench does move at all when doing any exercise on it even tri dips. Pad is comfortable for everything I use it for although I’m not doing heavy bench press but even if I was I still think it would be ok.\nOnly issue was one end of the pad was a bit mouldy when I unpacked it, wiped off no issue and everything else was sturdy and extremely well built. Highly recommended but of kit. "},{"author":"\nD Att ","date":"\nFeb 17, 2023 ","title":"\nBench ","rating":"\n100%\n","body":"\nSolid and sturdy bench, easy to the put together on your own, feels like it will last a very long time and super trippy pad to keep you locked in place "},{"author":"\nnickcl ","date":"\nJan 9, 2023 ","title":"\nReally sturdy ","rating":"\n100%\n","body":"\nI thought this was an excellent bench. Pleased with my purchase. Some benches do not measure up (they are too narrow/small) but this is perfect and solid. "},{"author":"\nLucy ","date":"\nSep 17, 2022 ","title":"\nLooks great, very sturdy and easy to assemble ","rating":"\n100%\n","body":"\nMy new Mirafit bench looks great in my gym. It seems to be a quality product which was easy to assemble and I enjoy using it. "},{"author":"\nT ","date":"\nJun 2, 2022 ","title":"\nThe only way to chill ","rating":"\n100%\n","body":"\nLooking for that ultimate comfort?\nBench your way to a bigger chest with this amazing flat couch, also doubles up as work from home office chair.\nKeep it up Mira! "}]}